## Einführung Pandas

Pandas kann man sich als eine sehr mächtige Version von Excel vorstellen, welche viel mehr Werkzeuge liefert. Hier behandeln:
    - Series
    - Dataframes
    - Missing Data 
    - GroupBy
    - Merging, Joining und Concatenating
    - Operationen
    - Dateneingabe und -ausgabe

** Auch hier müssen wir Pandas erstmal installieren! **
via conda: `conda install pandas`

### Series
Eine Folge in Pandas ist fast genau wie ein Numpy Array und fast genau wie eine Liste mit einem individuellen Index. Allerdings erlaubt eine Pandas Serie im Gegensatz zu einem Numpy Array, dass die Achsen beschriftet bzw gelabelt sein können. Es kann zudem jedes beliebige Python Objekt beinhalten.

In [1]:
# imports

import numpy as np
import pandas as pd

In [2]:
labels = ["a","b","c"]
liste = [1,2,3]
arr = np.array([10,20,30])
d = {"a":10, "b":20, "c":30}

#### Pandas Serie aus einer Liste

In [3]:
pd.Series(data=liste)

0    1
1    2
2    3
dtype: int64

In [4]:
pd.Series(data=liste,index=labels)

a    1
b    2
c    3
dtype: int64

In [5]:
# hier nochmal: parameter-namen müssen nicht angegeben werden, wenn man die reihenfolge der parameter einhält!
pd.Series(liste,labels)

a    1
b    2
c    3
dtype: int64

#### Pandas Serie aus einem Numpy Array

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

#### Pandas Serie aus einem Dictionary

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

#### Index
Die Möglichkeit Indexs zu verwenden macht Pandas Serien sehr nützlich.
Beispiel:

In [9]:
serie = pd.Series([1,2,3,4], index=["Sven", "Arthur", "Rainer", "Georg"])

In [10]:
serie

Sven      1
Arthur    2
Rainer    3
Georg     4
dtype: int64

In [11]:
serie2 = pd.Series([1,2,5,4], index = ["Sven", "Arthur", "Rainer", "Georg"])

In [12]:
serie2

Sven      1
Arthur    2
Rainer    5
Georg     4
dtype: int64

In [13]:
serie2["Georg"]

4

Operationen orientieren sich am Index

In [14]:
serie2 + serie

Sven      2
Arthur    4
Rainer    8
Georg     8
dtype: int64

## Pandas DataFrames

DataFrames ist das wohl wichtigste Konzept, wenn es um Data Science mit Python geht. Im Grunde sind DataFrames mehrere einzelne Serien welche den gleichen Index teilen und somit eine Art Tabelle (DataFrame) bilden.

In [15]:
rng=np.random.default_rng()

In [16]:
df = pd.DataFrame(rng.random((6,5)), index='A B C D E F'.split(), columns="V W X Y Z".split())

In [17]:
df

          V         W         X         Y         Z
A  0.303419  0.138011  0.068681  0.305366  0.138639
B  0.726093  0.789230  0.988323  0.330116  0.167930
C  0.617137  0.352257  0.048857  0.559148  0.642110
D  0.130931  0.393122  0.719389  0.728424  0.484442
E  0.203104  0.106215  0.915061  0.507295  0.219338
F  0.124870  0.368881  0.026904  0.916693  0.820603

#### Selecting und Indexing

In [18]:
df["X"]

A    0.068681
B    0.988323
C    0.048857
D    0.719389
E    0.915061
F    0.026904
Name: X, dtype: float64

Gibt uns die Spalte mit dem Index X zurück, welche nichts anderes als eine Pandas Serie ist!

In [19]:
# man kann auch gleich mehrere Spalten ausgeben lassen, indem man eine Liste mit den Indexen übergibt
df[["W","X"]]

          W         X
A  0.138011  0.068681
B  0.789230  0.988323
C  0.352257  0.048857
D  0.393122  0.719389
E  0.106215  0.915061
F  0.368881  0.026904

In [20]:
# es gibt auch eine andere Syntax, welche sich and SQL orientiert
df.W
# Allerdings werden wir diesen nicht verwenden!

A    0.138011
B    0.789230
C    0.352257
D    0.393122
E    0.106215
F    0.368881
Name: W, dtype: float64

#### Neue Spalte erzeugen

In [21]:
df["neu"] = df["X"] + df["Z"]

In [22]:
df["neu"]

A    0.207320
B    1.156253
C    0.690967
D    1.203831
E    1.134400
F    0.847508
Name: neu, dtype: float64

In [23]:
df

          V         W         X         Y         Z       neu
A  0.303419  0.138011  0.068681  0.305366  0.138639  0.207320
B  0.726093  0.789230  0.988323  0.330116  0.167930  1.156253
C  0.617137  0.352257  0.048857  0.559148  0.642110  0.690967
D  0.130931  0.393122  0.719389  0.728424  0.484442  1.203831
E  0.203104  0.106215  0.915061  0.507295  0.219338  1.134400
F  0.124870  0.368881  0.026904  0.916693  0.820603  0.847508

#### Spalten löschen

In [24]:
df.drop("neu",axis=1)

          V         W         X         Y         Z
A  0.303419  0.138011  0.068681  0.305366  0.138639
B  0.726093  0.789230  0.988323  0.330116  0.167930
C  0.617137  0.352257  0.048857  0.559148  0.642110
D  0.130931  0.393122  0.719389  0.728424  0.484442
E  0.203104  0.106215  0.915061  0.507295  0.219338
F  0.124870  0.368881  0.026904  0.916693  0.820603

In [25]:
# es wird nur aus der Ansicht gelöscht, aber nicht aus dem eigentlichen DataFrame (das muss explizit spezifiziert werden)!
df

          V         W         X         Y         Z       neu
A  0.303419  0.138011  0.068681  0.305366  0.138639  0.207320
B  0.726093  0.789230  0.988323  0.330116  0.167930  1.156253
C  0.617137  0.352257  0.048857  0.559148  0.642110  0.690967
D  0.130931  0.393122  0.719389  0.728424  0.484442  1.203831
E  0.203104  0.106215  0.915061  0.507295  0.219338  1.134400
F  0.124870  0.368881  0.026904  0.916693  0.820603  0.847508

In [26]:
# um die Spalte 'komplett' zu löschen muss der inplace-Parameter auf True gesetzt werden
df.drop("neu",axis=1,inplace=True)

In [27]:
df

          V         W         X         Y         Z
A  0.303419  0.138011  0.068681  0.305366  0.138639
B  0.726093  0.789230  0.988323  0.330116  0.167930
C  0.617137  0.352257  0.048857  0.559148  0.642110
D  0.130931  0.393122  0.719389  0.728424  0.484442
E  0.203104  0.106215  0.915061  0.507295  0.219338
F  0.124870  0.368881  0.026904  0.916693  0.820603

#### Zeilen löschen

Funktioniert genauso, nur muss der axis-Parameter auf 0 gesetzt werden

In [28]:
df.drop("F",axis=0)

          V         W         X         Y         Z
A  0.303419  0.138011  0.068681  0.305366  0.138639
B  0.726093  0.789230  0.988323  0.330116  0.167930
C  0.617137  0.352257  0.048857  0.559148  0.642110
D  0.130931  0.393122  0.719389  0.728424  0.484442
E  0.203104  0.106215  0.915061  0.507295  0.219338

#### Reihen auswählen

In [29]:
df.loc["A"]

V    0.303419
W    0.138011
X    0.068681
Y    0.305366
Z    0.138639
Name: A, dtype: float64

In [30]:
# man kann auch die Position, anstelle des Index-Namens benutzen
df.iloc[4]

V    0.203104
W    0.106215
X    0.915061
Y    0.507295
Z    0.219338
Name: E, dtype: float64

#### Teilmengen von Zeilen und Spalten auswählen

In [31]:
df.loc["B","Z"]

0.16793045458449518

In [32]:
df.loc[["A","B"],["Y","Z"]]

          Y         Z
A  0.305366  0.138639
B  0.330116  0.167930

#### Bedingte Auswahl

In [33]:
df>0

      V     W     X     Y     Z
A  True  True  True  True  True
B  True  True  True  True  True
C  True  True  True  True  True
D  True  True  True  True  True
E  True  True  True  True  True
F  True  True  True  True  True

In [34]:
df[df>0]

          V         W         X         Y         Z
A  0.303419  0.138011  0.068681  0.305366  0.138639
B  0.726093  0.789230  0.988323  0.330116  0.167930
C  0.617137  0.352257  0.048857  0.559148  0.642110
D  0.130931  0.393122  0.719389  0.728424  0.484442
E  0.203104  0.106215  0.915061  0.507295  0.219338
F  0.124870  0.368881  0.026904  0.916693  0.820603

In [35]:
df[df["V"]>0]

          V         W         X         Y         Z
A  0.303419  0.138011  0.068681  0.305366  0.138639
B  0.726093  0.789230  0.988323  0.330116  0.167930
C  0.617137  0.352257  0.048857  0.559148  0.642110
D  0.130931  0.393122  0.719389  0.728424  0.484442
E  0.203104  0.106215  0.915061  0.507295  0.219338
F  0.124870  0.368881  0.026904  0.916693  0.820603

In [36]:
df[df["V"]>0]["Z"]

A    0.138639
B    0.167930
C    0.642110
D    0.484442
E    0.219338
F    0.820603
Name: Z, dtype: float64

In [37]:
df[df["V"]>0][["Y","Z"]]

          Y         Z
A  0.305366  0.138639
B  0.330116  0.167930
C  0.559148  0.642110
D  0.728424  0.484442
E  0.507295  0.219338
F  0.916693  0.820603

#### Weitere Möglichkeiten

In [38]:
df

          V         W         X         Y         Z
A  0.303419  0.138011  0.068681  0.305366  0.138639
B  0.726093  0.789230  0.988323  0.330116  0.167930
C  0.617137  0.352257  0.048857  0.559148  0.642110
D  0.130931  0.393122  0.719389  0.728424  0.484442
E  0.203104  0.106215  0.915061  0.507295  0.219338
F  0.124870  0.368881  0.026904  0.916693  0.820603

In [39]:
# Index zurücksetzen auf 0,1,...,n Index
df.reset_index()
# wieder nicht inplace, da Parameter nicht gesetzt

  index         V         W         X         Y         Z
0     A  0.303419  0.138011  0.068681  0.305366  0.138639
1     B  0.726093  0.789230  0.988323  0.330116  0.167930
2     C  0.617137  0.352257  0.048857  0.559148  0.642110
3     D  0.130931  0.393122  0.719389  0.728424  0.484442
4     E  0.203104  0.106215  0.915061  0.507295  0.219338
5     F  0.124870  0.368881  0.026904  0.916693  0.820603

In [40]:
index_neu = "BW BY HE TH RP SAA".split()

In [41]:
df['Laender'] = index_neu

In [42]:
df

          V         W         X         Y         Z Laender
A  0.303419  0.138011  0.068681  0.305366  0.138639      BW
B  0.726093  0.789230  0.988323  0.330116  0.167930      BY
C  0.617137  0.352257  0.048857  0.559148  0.642110      HE
D  0.130931  0.393122  0.719389  0.728424  0.484442      TH
E  0.203104  0.106215  0.915061  0.507295  0.219338      RP
F  0.124870  0.368881  0.026904  0.916693  0.820603     SAA

In [43]:
# Laender als Index auswählen
df.set_index("Laender")

                V         W         X         Y         Z
Laender
BW       0.303419  0.138011  0.068681  0.305366  0.138639
BY       0.726093  0.789230  0.988323  0.330116  0.167930
HE       0.617137  0.352257  0.048857  0.559148  0.642110
TH       0.130931  0.393122  0.719389  0.728424  0.484442
RP       0.203104  0.106215  0.915061  0.507295  0.219338
SAA      0.124870  0.368881  0.026904  0.916693  0.820603

In [44]:
df

          V         W         X         Y         Z Laender
A  0.303419  0.138011  0.068681  0.305366  0.138639      BW
B  0.726093  0.789230  0.988323  0.330116  0.167930      BY
C  0.617137  0.352257  0.048857  0.559148  0.642110      HE
D  0.130931  0.393122  0.719389  0.728424  0.484442      TH
E  0.203104  0.106215  0.915061  0.507295  0.219338      RP
F  0.124870  0.368881  0.026904  0.916693  0.820603     SAA

In [45]:
df.set_index('Laender',inplace=True)

In [46]:
df

                V         W         X         Y         Z
Laender
BW       0.303419  0.138011  0.068681  0.305366  0.138639
BY       0.726093  0.789230  0.988323  0.330116  0.167930
HE       0.617137  0.352257  0.048857  0.559148  0.642110
TH       0.130931  0.393122  0.719389  0.728424  0.484442
RP       0.203104  0.106215  0.915061  0.507295  0.219338
SAA      0.124870  0.368881  0.026904  0.916693  0.820603

### Multi-Index und Index Hierarchie

In [47]:
# Index Level
hoch = ["L1","L1","L1","L2","L2","L2"]
niedrig = [1,2,3,1,2,3]
index_hier = list(zip(hoch,niedrig))
index_hier = pd.MultiIndex.from_tuples(index_hier)

In [48]:
index_hier

MultiIndex([('L1', 1),
            ('L1', 2),
            ('L1', 3),
            ('L2', 1),
            ('L2', 2),
            ('L2', 3)],
           )

In [49]:
df = pd.DataFrame(np.random.randn(6,2),index=index_hier,columns=["A","B"])
df

             A         B
L1 1 -0.097260 -0.681457
   2 -0.645484  1.996937
   3  0.667854 -0.711124
L2 1  0.989987 -0.188673
   2  1.097089  2.223437
   3 -0.131446  0.332333

In [50]:
df.loc["L1"]

          A         B
1 -0.097260 -0.681457
2 -0.645484  1.996937
3  0.667854 -0.711124

In [51]:
df.loc["L1"].loc[2]

A   -0.645484
B    1.996937
Name: 2, dtype: float64

In [52]:
# andere Möglichkeit für df.loc['G1'] - cross-section
df.xs("L1")

          A         B
1 -0.097260 -0.681457
2 -0.645484  1.996937
3  0.667854 -0.711124

In [53]:
df.xs(['L1',1])

A   -0.097260
B   -0.681457
Name: (L1, 1), dtype: float64

## Missing Data
In Data Science ist es wichtig im Schritt Data Preprocessing mit 'Missing Data' (also fehlenden Daten) entsprechend umzugehen.

In [54]:
df = pd.DataFrame({"A":[1,2,np.nan],
                  "B":[5,np.nan,np.nan],
                  "C":[1,2,3]})

In [55]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [56]:
# Lösche die Zeilen, die fehlende Daten haben
df.dropna()

     A    B  C
0  1.0  5.0  1

In [57]:
# Lösche die Spalten die fehlende Daten haben
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [58]:
# Setze ein Threshold wieviele fehlende Daten geduldet werden
# thresh=2 bedeutet max ein Wert darf fehlen
# how = any / all
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [61]:
df.dropna(how='any')

     A    B  C
0  1.0  5.0  1

In [62]:
# meistens überlegt man sich eine Strategie, wie man mit fehlenden Werten umgeht. Bei Zahlen könnte man sich überlegen
# den Mittelwert zu nehmen
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### GroupBy

In [63]:
# Daten für das DataFrame
data = {"Uni":["UniMa","UniMa","LMU","LMU","KIT","KIT"],
       "Person":["Simon","Fred","Felix","Sofie","Sarah","Celine"],
       "Spende":[2500,50000,3000,750,1500,500000]}

In [64]:
df = pd.DataFrame(data)

In [65]:
df

     Uni  Person  Spende
0  UniMa   Simon    2500
1  UniMa    Fred   50000
2    LMU   Felix    3000
3    LMU   Sofie     750
4    KIT   Sarah    1500
5    KIT  Celine  500000

In [66]:
by_uni = df.groupby("Uni")

In [67]:
by_uni

In [68]:
# Durchschnitt pro Uni
by_uni.mean()

       Spende
Uni
KIT    250750
LMU      1875
UniMa   26250

In [69]:
# Geht natürlich auch direkt
df.groupby("Uni").mean()

       Spende
Uni
KIT    250750
LMU      1875
UniMa   26250

In [70]:
# Standardabweichung
df.groupby("Uni").std()

              Spende
Uni
KIT    352492.730421
LMU      1590.990258
UniMa   33587.572106

In [71]:
# Min
df.groupby('Uni').min()

       Person  Spende
Uni
KIT    Celine    1500
LMU     Felix     750
UniMa    Fred    2500

In [72]:
# Max
df.groupby("Uni").max()

      Person  Spende
Uni
KIT    Sarah  500000
LMU    Sofie    3000
UniMa  Simon   50000

In [73]:
# Anzahl
df.groupby("Uni").count()

       Person  Spende
Uni
KIT         2       2
LMU         2       2
UniMa       2       2

In [74]:
# ganz wichtige Funktion: describe()
df.groupby("Uni").describe()

      Spende                                                                 \
       count      mean            std     min       25%       50%       75%
Uni
KIT      2.0  250750.0  352492.730421  1500.0  126125.0  250750.0  375375.0
LMU      2.0    1875.0    1590.990258   750.0    1312.5    1875.0    2437.5
UniMa    2.0   26250.0   33587.572106  2500.0   14375.0   26250.0   38125.0


            max
Uni
KIT    500000.0
LMU      3000.0
UniMa   50000.0

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Uni     6 non-null      object
 1   Person  6 non-null      object
 2   Spende  6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [77]:
df.groupby("Uni").describe().transpose()

Uni                     KIT          LMU         UniMa
Spende count       2.000000     2.000000      2.000000
       mean   250750.000000  1875.000000  26250.000000
       std    352492.730421  1590.990258  33587.572106
       min      1500.000000   750.000000   2500.000000
       25%    126125.000000  1312.500000  14375.000000
       50%    250750.000000  1875.000000  26250.000000
       75%    375375.000000  2437.500000  38125.000000
       max    500000.000000  3000.000000  50000.000000

In [80]:
df.groupby("Uni").describe().transpose()["UniMa"]

Spende  count        2.000000
        mean     26250.000000
        std      33587.572106
        min       2500.000000
        25%      14375.000000
        50%      26250.000000
        75%      38125.000000
        max      50000.000000
Name: UniMa, dtype: float64

## Merging, Joining und Concatenating

In [81]:
# data für df1
df1 = pd.DataFrame({"A": ["A0", "A1", "A2", "A3"],
                    "B": ["B0", "B1", "B2", "B3"],
                    "C": ["C0", "C1", "C2", "C3"],
                    "D": ["D0", "D1", "D2", "D3"]},
                    index=[0, 1, 2,3])

In [82]:
# data für df2
df2 = pd.DataFrame({"A": ["A4", "A5", "A6", "A7"],
                        "B": ["B4", "B5", "B6", "B7"],
                        "C": ["C4", "C5", "C6", "C7"],
                        "D": ["D4", "D5", "D6", "D7"]},
                         index=[4, 5, 6, 7])

In [83]:
# data für df2
df3 = pd.DataFrame({"A": ["A8", "A9", "A10", "A11"],
                        "B": ["B8", "B9", "B10", "B11"],
                        "C": ["C8", "C9", "C10", "C11"],
                        "D": ["D8", "D9", "D10", "D11"]},
                         index=[8, 9, 10, 11])

In [84]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

#### Concatenation (Verkettung)
Verkettet DataFrames. Die Länge der Achse, auf die verkettet wird, muss übereinstimmen. Zum Verketten kann man pd.concat verwenden.

In [85]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [86]:
# mit axis=1 verketten
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

#### Beispiel-DataFrames

In [87]:
left = pd.DataFrame({"key": ["K0", "K1", "K2", "K3"],
                     "A": ["A0", "A1", "A2", "A3"],
                     "B": ["B0", "B1", "B2", "B3"]})
   
right = pd.DataFrame({"key": ["K0", "K1", "K2", "K3"],
                          "C": ["C0", "C1", "C2", "C3"],
                          "D": ["D0", "D1", "D2", "D3"]})

In [88]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [89]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

#### Merging

Die **merge** Funktion erlaubt es DataFrames basierend auf einem Kriterium zu fusionieren.

In [90]:
pd.merge(left,right,how="inner",on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [91]:
# komplizierteres Beispiel
left = pd.DataFrame({"key1": ["K0", "K0", "K1", "K2"],
                     "key2": ["K0", "K1", "K0", "K1"],
                        "A": ["A0", "A1", "A2", "A3"],
                        "B": ["B0", "B1", "B2", "B3"]})
    
right = pd.DataFrame({"key1": ["K0", "K1", "K1", "K2"],
                               "key2": ["K0", "K0", "K0", "K0"],
                                  "C": ["C0", "C1", "C2", "C3"],
                                  "D": ["D0", "D1", "D2", "D3"]})

In [92]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [93]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [94]:
pd.merge(left, right, on=["key1", "key2"])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [95]:
pd.merge(left, right, how='outer', on=["key1", "key2"])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [96]:
pd.merge(left, right, how="right", on=["key1", "key2"])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [97]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

#### Joining

In [98]:
left = pd.DataFrame({"A": ["A0", "A1", "A2"],
                     "B": ["B0", "B1", "B2"]},
                      index=["K0", "K1", "K2"]) 

right = pd.DataFrame({"C": ["C0", "C2", "C3"],
                    "D": ["D0", "D2", "D3"]},
                      index=["K0", "K2", "K3"])

In [99]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [100]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [101]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [102]:
left.join(right, how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operationen

Es gibt vesrschiedene wichtige Operationen, die nützlich für uns sein können. Ein paar möchten wir hier kennenlernen. Aber wie immer gilt im programmieren. Dokumentationen der Bibliotheken bzw das Internet zu durchforschen, falls man ein Problem lösen möchte

In [105]:
df = pd.DataFrame({"col1":[1,2,3,4],"col2":[11,44,66,11],"col3":["abc","def","ghi","xyz"]})
df.head()

   col1  col2 col3
0     1    11  abc
1     2    44  def
2     3    66  ghi
3     4    11  xyz

#### Eindeutige Werte rausfinden

In [108]:
df["col2"].unique()

array([11, 44, 66])

In [109]:
#Hier Frage!
#Anzahl eindeutiger Werte rausfinden
#Möglichkeit1
len(df["col2"].unique())

3

In [110]:
# Aber auch hier gibt es bereits eine fertige Methode
df["col2"].nunique()

3

In [115]:
#Anzeigen wie oft die einzelnen Werte vorkommen
df["col2"].value_counts()

11    2
66    1
44    1
Name: col2, dtype: int64

In [116]:
#Selektieren von einem DataFrame basierend auf Kritieren für mehrere Spalten
newdf = df[(df["col1"]>1) & (df["col2"]==11)]

In [117]:
newdf

   col1  col2 col3
3     4    11  xyz

#### Funktionen auf DataFrame anwenden

In [118]:
def times2(x):
    return x*2

In [126]:
df.apply(times2)

   col1  col2    col3
0     2    22  abcabc
1     4    88  defdef
2     6   132  ghighi
3     8    22  xyzxyz

In [125]:
'hi'*2

'hihi'

In [121]:
df["col1"].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [123]:
df["col1"].sum()

10

#### Eine Spalte für immer Löschen

In [128]:
del df["col1"]

In [129]:
df

   col2 col3
0    11  abc
1    44  def
2    66  ghi
3    11  xyz

#### Spalten- und Indexnamen zurückgeben

In [130]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [131]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [132]:
df.values

array([[11, 'abc'],
       [44, 'def'],
       [66, 'ghi'],
       [11, 'xyz']], dtype=object)

#### DataFrame sortieren

In [134]:
df.sort_values(by="col2",ascending=False) #inplace=False bei default

   col2 col3
2    66  ghi
1    44  def
0    11  abc
3    11  xyz

#### Nullwerte finden

In [135]:
df.isnull() # auch hier Kombination mit .all() oder .any() möglich

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [136]:
# Zeilen mit Nullwerten löschen
df.dropna()

   col2 col3
0    11  abc
1    44  def
2    66  ghi
3    11  xyz

## Dateneingabe und -ausgabe

Das Laden von Datensätzen erfolgt über eine der folgenden Funktionen:

    - pd.read_csv
    - pd.read_excel
    - pd.read_html

Für einen Überblick siehe https://pandas.pydata.org/pandas-docs/stable/io.html

Bsp:

    pd.read_csv('myfile.csv')

### CSV

#### CSV Eingabe

In [137]:
tips_dataset = pd.read_csv("https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/tips.csv")

In [138]:
tips_dataset.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

#### CSV Ausgabe

In [139]:
tips_dataset.to_csv("tips_dataset.csv", index=False)

### Excel

Pandas kann Excel-Dateien lesen und schreiben. **Aber Pandas kann nur Daten importiert.** Keine Formeln, Bilder, Makros! Kann zum Absturz führen!

#### Excel Eingabe

Es muss das Paket ***xlrd*** installiert sein.

In [140]:
pd.read_excel("02_pandas_excelbsp.xlsx", sheet_name="BL_7-Tage-Inzidenz")

,Bundesland,2020-05-06 00:00:00,2020-05-07 00:00:00,2020-05-08 00:00:00,2020-05-09 00:00:00,2020-05-10 00:00:00,2020-05-11 00:00:00,2020-05-12 00:00:00,2020-05-13 00:00:00,2020-05-14 00:00:00,...,2020-10-16 00:00:00,2020-10-17 00:00:00,2020-10-18 00:00:00,2020-10-19 00:00:00,2020-10-20 00:00:00,2020-10-21 00:00:00,2020-10-22 00:00:00,2020-10-23 00:00:00,2020-10-24 00:00:00,2020-10-25 00:00:00
0,Baden-Württemberg,8.202695,7.037334,6.007480,6.377866,6.974097,6.865692,6.992165,6.721151,6.910861,...,38.070721,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Bayern,10.078979,9.528383,9.038963,9.352497,8.778959,8.801901,9.161318,9.130729,8.526602,...,35.406424,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Berlin,7.363637,7.070158,7.256917,7.470356,7.176878,6.616601,5.282609,4.535573,4.162056,...,73.852205,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Brandenburg,4.976279,4.617987,4.657797,5.215140,4.697607,4.697607,4.180074,2.866337,1.990512,...,20.302209,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Bremen,17.423490,18.448402,20.498224,22.694462,24.890701,24.158621,22.108799,23.426542,19.619729,...,73.106068,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,Hamburg,5.159737,4.616607,4.670920,4.833859,4.345042,4.616607,4.507981,4.019164,3.095842,...,32.643065,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,Hessen,7.133955,6.703045,6.766884,6.623247,7.277592,7.086076,7.054157,6.495570,6.176377,...,46.755130,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,Mecklenburg-Vorpommern,1.428860,1.428860,1.366736,1.366736,1.490984,1.615233,1.428860,1.428860,1.428860,...,13.991337,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,Niedersachsen,4.522422,4.384620,4.397147,5.386819,5.223961,5.374291,4.710334,3.820883,3.883520,...,27.421910,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,Nordrhein-Westfalen,8.169456,8.353478,7.689884,8.074657,8.080233,8.342325,8.559805,8.448277,7.779106,...,49.812726,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,Rheinland-Pfalz,5.091994,4.308610,3.843476,3.892438,3.647630,4.186206,4.528937,3.916918,3.721072,...,26.795945,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,Saarland,9.490070,8.783363,6.461324,5.552701,5.249826,5.047910,4.139286,3.533537,3.028746,...,44.787296,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,Sachsen,3.653808,3.972597,3.800942,4.168775,3.997119,4.463041,5.125140,4.021641,4.193297,...,25.368550,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,Sachsen-Anhalt,2.445297,2.264164,2.354730,2.716996,2.626430,2.581146,2.535863,1.766048,1.675481,...,8.155707,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,Schleswig-Holstein,4.833066,4.902110,5.143763,6.006810,6.973424,5.903245,5.488982,4.418803,4.246194,...,12.225474,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,Thüringen,9.238759,8.398872,8.352211,8.678834,8.772155,10.078646,9.098778,8.585513,7.932268,...,17.624631,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#### Excel Ausgabe

Dazu wird das paket ***openpyxl*** benötigt.

In [141]:
df.to_excel('beispiel_neu.xlsx',sheet_name='Sheet1')

### HTML

Je nachdem was man einlesen möchte gibt es hier weiterführende Bibliotheken, die man zuvor installieren muss.

    - pip install lxml
    - pip install html5lib
    - pip install BeautifulSoup4
    
Jupyter neustarten und dann kann es losgehen!

** Pandas kann allerdings bereits Tabellen aus html extrahieren.** 
Bsp:

In [142]:
test = pd.read_html('https://www.taschenhirn.de/politik-und-religion/deutsche-bundeskanzler/')

In [146]:
#Achtung ist eine Liste nach import.
test[0]

,Deutsche Bundeskanzler,Amtszeit,Amtsdauer in Tagen,Geboren,Gestorben,Kurzbiografie (Auswahl),Video/Film
0,Konrad Adenauer (CDU),1949-1963,5 144,5.1.1876 in Köln,19.4.1967 in Rhöndorf,Konrad Adenauer war der erste deutsche Bundesk...,NaN
1,Ludwig Erhard (CDU),1963-1966,1 142,4.2.1897 in Fürth,5.5.1977 in Bonn,Ludwig Erhard studierte nach seinem Kriegseins...,NaN
2,Kurt Georg Kiesinger (CDU),1966-1969,1 055,6.4.1904 in Ebingen,9.3.1988 in Tübingen,Kurt Georg Kiesinger studierte von 1926 bis 19...,NaN
3,Willy Brandt (SPD),1969-1974,1 659,18.12.1913 in Lübeck,8.10.1992 in Unkel (bei Bonn),Willy Brandt wurde 1913 als Herbert Ernst Karl...,NaN
4,Walter Scheel (FDP),1974,9,8.7.1919 in Höhscheid,24.8.2016 in Bad Krozingen,Nach dem Rücktritt Willy Brandts übernahm der ...,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,Helmut Schmidt (SPD),1974-1982,3 060,23.12.1918 in Hamburg-Barmbek,10.11.2015 in Hamburg-Langenhorn,Der studierte Volkswirt Helmut Schmidt war von...,NaN
7,Helmut Kohl (CDU),1982-1998,5 870,3.4.1930 in Ludwigshafen-Friesenheim,16.6.2017 in Ludwigshafen-Oggersheim,"Helmut Kohl war zu jung, um in den 2. Weltkrie...",NaN
8,Gerhard Schröder (SPD),1998-2005,2 583,7.4.1944 in Blomberg-Mossenberg,NaN,Weil sein Vater kurz nach seiner Geburt im 2. ...,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,Angela Merkel (CDU),2005-2021,5 770+,17.7.1954 in Hamburg,NaN,Unsere Bundeskanzlerin Angela Merkel wurde zwa...,NaN
11,Wer wird neue(r) Bundeskanzler*in in Deutschland?,ab 2021,NaN,NaN,NaN,Bundeskanzlerin Angela Merkel verzichtet auf e...,NaN

In [144]:
len(test)

1